In [1]:
import pandas as pd

# Exploratory Data Analysis

In [2]:
df = pd.read_csv('movie_titles.csv', on_bad_lines='skip', encoding = "ISO-8859-1", names=['CustID', 'Year', 'Title'])

In [3]:
df.head(10)

   CustID    Year                         Title
0       1  2003.0               Dinosaur Planet
1       2  2004.0    Isle of Man TT 2004 Review
2       3  1997.0                     Character
3       4  1994.0  Paula Abdul's Get Up & Dance
4       5  2004.0      The Rise and Fall of ECW
5       6  1997.0                          Sick
6       7  1992.0                         8 Man
7       8  2004.0    What the #$*! Do We Know!?
8       9  1991.0      Class of Nuke 'Em High 2
9      10  2001.0                       Fighter

In [22]:
training = pd.read_csv("combined_data_1.txt", sep=",", header=None, on_bad_lines='skip', names=['CustID', 'Rating', 'Date'])

In [25]:
training.head(10)

    CustID  Rating        Date
0       1:     NaN         NaN
1  1488844     3.0  2005-09-06
2   822109     5.0  2005-05-13
3   885013     4.0  2005-10-19
4    30878     4.0  2005-12-26
5   823519     3.0  2004-05-03
6   893988     3.0  2005-11-17
7   124105     4.0  2004-08-05
8  1248029     3.0  2004-04-22
9  1842128     4.0  2004-05-09

--------------------------------